Agile/bugsnonbugs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Bugs, Non-Bugs and Scrum</title>
<!-- 2016-02-01 Mon 21:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Bugs, Non-Bugs and Scrum</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Non-Bugs - Issues arising with stories in sprint</a></li>
<li><a href="#sec-3">Bugs - Issues arising from 'Done' stories</a></li>
<li><a href="#sec-4">Pre-Scrum Bugs - What to do with these?</a></li>
<li><a href="#sec-5">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
As a result of some discussion, with regards to using TFS
to track issues arising within a sprint, I thought I'd post some
thoughts on bugs and scrum.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Non-Bugs - Issues arising with stories in sprint</h2>
<div class="outline-text-2" id="text-2">
<p>
In theory, a Story or PBI is not ‘done’ until it is bug free. I know
this is an idealistic view, but does in principal remain
true. Furthermore, a story is not done until it meets the Definition
of Done, which should include bug free .
</p>

<p>
So is an issue in a none-done story a bug? No. Does it need to be
recorded and tracked in TFS? Depends. It works for us not to, as we do
maintain a pretty close communication within the team and minimise the
work in progress such that tracking the item in TFS is not really
necessary. Also the Daily Scrum is there to ensure a regular
communication with team members to update everyone on the status of
the sprint and stories in it, including issues arising. 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Bugs - Issues arising from 'Done' stories</h2>
<div class="outline-text-2" id="text-3">
<p>
One of the important principles of Scrum is a predictable velocity
and a velocity that represents delivered value. This second point is
important when it comes to bugs.
</p>

<p>
If bugs are allowed to contribute to velocity, then velocity no
longer represents delivered value and cannot be used as a measure of
the teams improvement, as the stories they are associated with have
already been marked as done and contributed to velocity. An example:
</p>

<p>
Sprint 1: Velocity 10
</p>

<ul class="org-ul">
<li>Story 1 completed = 5 points
</li>
<li>Story 2 completed = 5 points
</li>
</ul>

<p>
Sprint 2: Velocity = 10
</p>

<ul class="org-ul">
<li>Story 3 completed = 5 points
</li>
<li>Bug from story 1 = 2 points
</li>
<li>Bug from story 2 = 3 points
</li>
</ul>

<p>
Sprint 3: Velocity = 11
</p>

<ul class="org-ul">
<li>Bug from story 1 = 3 points
</li>
<li>Bug from story 2 = 3 points
</li>
<li>Bug from story 3 = 5 points 
</li>
</ul>

<p>
Just looking at velocity, one would presume that the team is
improving its process and efficiency, when clearly this is not the
case. The velocities should be 10, 5, 0. A downward trend that
indicates that something is drastically wrong and needs to be raised
in the retrospective.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Pre-Scrum Bugs - What to do with these?</h2>
<div class="outline-text-2" id="text-4">
<p>
The fact that Bugs generally do not contribute towards velocity is
one of the reasons why the Product Backlog and Bug List are often
two separate artefacts. However, if there are known bugs from
pre-Scrum days, then what to do about those? The answer is really on
whether you want the velocity to represent the rate of getting
through all known work (Backlog and Bugs) or whether you want, right
from the start, to be measuring a velocity based on the delivery of
value. I would suggest the second.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Summary</h2>
<div class="outline-text-2" id="text-5">
<p>
So the question is not so much “Should bugs be raised in TFS?” but
“Should bugs contribute to velocity?”. TFS is obviously just a tool
for helping or hindering the workflow. For us we find it easier to
just informally pass issues around as often the developer is already
aware of the issue and can state “yeah, just fixing it now”. The
daily scrum also helps ensure that at the start of each day everyone
is aware of the status of the sprint / stories.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-01 Mon 21:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
